package Object_oriented_6;

public class Syntax {

}


/**
 클래스의 정의 클래스란 객체를 정의해 놓은 것이다. 클래스는 객체의 설계도 또는 틀이라고 정의할 수 있다.
 클래스의 용도 클래스는 객체를 생성하는데 사용된다.
 
 객체의 사적적인 정의는 '실제로 존재하는 것' 사물 또는 개념
 객체의 용도는 객체가 가지고 있는 기능과 속성에 따라 다름
 
 클래스로부터 객체를 만드는 과정을 클래스의 인스턴스화 라고 하며,
 어떤 클래스로부터 만들어진 객체를 그 클래스의 인스턴스라고 한다.
 
 결국 인스턴스는 객체와 같은 의미이지만, 객체는 모든 인스턴스를 대표하는 포괄적인 의미를 갖고 있으며,
 인스턴스는 어떤 클래스로부터 만들어진 것인지를 강조하는 보다 구체적인 의미를 갖고 있다.
 
 클래스의 타입으로 선언되었을 때 객체라고 부르고, 그 객체가 메모리에 할당되어 실제 사용될 때 인스턴스라고 부른다.
 
 객체는 '실체', 인스턴스는 '관계'에 초점을 맞춘다.
 
생성자 (Constructor)란 객체가 생성될 때 자동으로 호출되는 메서드를 의미한다

*/